app/Http/Controllers/ClassroomController.php

select * from `classrooms`
---
    public function Classrooms()
    {
        $classrooms = Classroom::all();