app/Http/Controllers/DataSiswaController.php

    public function index()
    {
        $students = Student::all();
---
select * from `students`