app/Http/Controllers/GuardianController.php

select * from `guardians`
---
    public function guardians()
    {
        $guardians = Guardian::all();