app/Http/Controllers/SubjectController.php

    public function subjects()
    {
        $subjects = Subject::all();
---
select * from `subjects`