app/Http/Controllers/TeacherController.php

select * from `teachers`
---
    public function teachers()
    {
        $teachers = Teacher::all();