app/Http/Controllers/admin/AdminStudentController.php

    public function store(Request $request)
    {
        $validated = $request->validate([
            'name' => 'required|string|max:255',
            'email' => 'required|email|unique:students,email',
            'address' => 'required|string',
            'classroom_id' => 'required|exists:classrooms,id',
            'birthdate' => 'required|date',
            'phone' => 'required|string',
            'grade' => 'nullable|string',
        ]);

        Student::create($validated);
---
insert into `students` (`name`, `email`, `address`, `classroom_id`, `birthdate`, `phone`, `grade`, `updated_at`, `created_at`) values ('Ravan', 'rokadoakwodk@amaodk.com', 'paijdawipjdawipdjawipjd', '6', '2025-11-28', '9294284', 'contoh', '2025-11-25 02:21:46', '2025-11-25 02:21:46')

    public function update(Request $request, $id)
    {
        $student = Student::findOrFail($id);

        $validated = $request->validate([
            'name' => 'required|string|max:255',
            'email' => 'required|email|unique:students,email,' . $student->id,
            'address' => 'required|string',
            'classroom_id' => 'required|exists:classrooms,id',
            'birthdate' => 'required|date',
            'phone' => 'required|string',
            'grade' => 'nullable|string',
        ]);

        $student->update($validated);
---
select * from `students` where `students`.`id` = '33' limit 1
update `students` set `classroom_id` = '3', `students`.`updated_at` = '2025-11-25 02:21:58' where `id` = 33

    public function delete($id)
    {
        $student = Student::findOrFail($id);
        $student->delete();
---
delete from `students` where `id` = 33