app/Http/Controllers/admin/AdminGuardianController.php

    public function index(Request $request)
    {
        $search = $request->search;

        $guardians = Guardian::query()
            ->when($search, function ($query) use ($search) {
                $query->where(function ($q) use ($search) {
                    $q->where('name', 'like', "%{$search}%")
                        ->orWhere('job', 'like', "%{$search}%")
                        ->orWhere('phone', 'like', "%{$search}%")
                        ->orWhere('email', 'like', "%{$search}%");
                });
            })
            ->paginate(10)
            ->withQueryString();
---
select * from `guardians` where (`name` like '%puti.yulianti%' or `job` like '%puti.yulianti%' or `phone` like '%puti.yulianti%' or `email` like '%puti.yulianti%') limit 10 offset 0
select count(*) as aggregate from `guardians` where (`name` like '%puti.yulianti%' or `job` like '%puti.yulianti%' or `phone` like '%puti.yulianti%' or `email` like '%puti.yulianti%')