app/Http/Controllers/admin/AdminTeacherController.php

    public function index(Request $request)
    {
        $search = $request->get('search');

        $teachers = Teacher::query()
            ->with('subject')
            ->when($search, function ($query) use ($search) {
                $query->where(function ($q) use ($search) {
                    $q->where('name', 'like', "%{$search}%")
                        ->orWhere('email', 'like', "%{$search}%")
                        ->orWhere('phone', 'like', "%{$search}%")
                        ->orWhere('address', 'like', "%{$search}%")
                        ->orWhereHas('subject', function ($s) use ($search) {
                            $s->where('name', 'like', "%{$search}%");
                        });
                });
            })
            ->paginate(10)
            ->withQueryString();

        $subjects = Subject::all();
---
select * from `teachers` where (`name` like '%Bahas%' or `email` like '%Bahas%' or `phone` like '%Bahas%' or `address` like '%Bahas%' or exists (select * from `subjects` where `teachers`.`subject_id` = `subjects`.`id` and `name` like '%Bahas%')) limit 10 offset 0
select count(*) as aggregate from `teachers` where (`name` like '%Bahas%' or `email` like '%Bahas%' or `phone` like '%Bahas%' or `address` like '%Bahas%' or exists (select * from `subjects` where `teachers`.`subject_id` = `subjects`.`id` and `name` like '%Bahas%'))
select * from `subjects`