app/Http/Controllers/admin/AdminStudentController.php

select * from `classrooms` where `classrooms`.`id` in (1, 2)
select * from `students` where (`name` like '%mar%' or `email` like '%mar%' or `birthdate` like '%mar%' or `grade` like '%mar%' or `address` like '%mar%' or `phone` like '%mar%' or exists (select * from `classrooms` where `students`.`classroom_id` = `classrooms`.`id` and `name` like '%mar%')) limit 10 offset 0
select count(*) as aggregate from `students` where (`name` like '%mar%' or `email` like '%mar%' or `birthdate` like '%mar%' or `grade` like '%mar%' or `address` like '%mar%' or `phone` like '%mar%' or exists (select * from `classrooms` where `students`.`classroom_id` = `classrooms`.`id` and `name` like '%mar%'))
select * from `classrooms`
---
    public function index(Request $request)
    {
        $search = $request->search;

        $datasiswa = Student::with('classroom')
            ->when($search, function ($query) use ($search) {
                $query->where(function ($q) use ($search) {
                    $q->where('name', 'like', "%{$search}%")
                        ->orWhere('email', 'like', "%{$search}%")
                        ->orWhere('birthdate', 'like', "%{$search}%") // betulin typo
                        ->orWhere('grade', 'like', "%{$search}%")
                        ->orWhere('address', 'like', "%{$search}%")
                        ->orWhere('phone', 'like', "%{$search}%")
                        ->orWhereHas('classroom', function ($qc) use ($search) {
                            $qc->where('name', 'like', "%{$search}%");
                        });
                });
            })
            ->paginate(10)
            ->withQueryString();

        $classrooms = Classroom::all();

select * from `students` where `students`.`id` = '33' limit 1
---
    public function update(Request $request, $id)
    {
        $student = Student::findOrFail($id);