app/Http/Controllers/admin/AdminSubjectController.php

    public function index(Request $request)
    {
        $search = $request->get('search');

        $subjects = Subject::query()
            ->with('teacher')
            ->when($search, function ($query) use ($search) {
                $query->where(function ($q) use ($search) {
                    $q->where('name', 'like', "%{$search}%")
                        ->orWhere('description', 'like', "%{$search}%")
                        ->orWhereHas('teacher', function ($t) use ($search) {
                            $t->where('name', 'like', "%{$search}%")
                                ->orWhere('email', 'like', "%{$search}%")
                                ->orWhere('phone', 'like', "%{$search}%");
                        });
                });
            })
            ->paginate(10)
            ->withQueryString();
---
select * from `subjects` where (`name` like '%Bahasa%' or `description` like '%Bahasa%' or exists (select * from `teachers` where `subjects`.`id` = `teachers`.`subject_id` and (`name` like '%Bahasa%' or `email` like '%Bahasa%' or `phone` like '%Bahasa%'))) limit 10 offset 0
select * from `teachers` where `teachers`.`subject_id` in (1, 2, 6, 9)
select count(*) as aggregate from `subjects` where (`name` like '%Bahasa%' or `description` like '%Bahasa%' or exists (select * from `teachers` where `subjects`.`id` = `teachers`.`subject_id` and (`name` like '%Bahasa%' or `email` like '%Bahasa%' or `phone` like '%Bahasa%')))