app/Http/Controllers/admin/AdminClassroomController.php

    public function index(Request $request)
    {
        $search = $request->get('search');

        $classrooms = Classroom::query()
            ->with('students')
            ->when($search, function ($query) use ($search) {
                $query->where(function ($q) use ($search) {
                    $q->where('name', 'like', "%{$search}%")
                        ->orWhereHas('students', function ($s) use ($search) {
                            $s->where('name', 'like', "%{$search}%")
                                ->orWhere('email', 'like', "%{$search}%")
                                ->orWhere('phone', 'like', "%{$search}%");
                        });
                });
            })
            ->paginate(10)
            ->withQueryString();
---
select * from `classrooms` where (`name` like '%Ivan%' or exists (select * from `students` where `classrooms`.`id` = `students`.`classroom_id` and (`name` like '%Ivan%' or `email` like '%Ivan%' or `phone` like '%Ivan%'))) limit 10 offset 0
select * from `students` where `students`.`classroom_id` in (1)
select count(*) as aggregate from `classrooms` where (`name` like '%Ivan%' or exists (select * from `students` where `classrooms`.`id` = `students`.`classroom_id` and (`name` like '%Ivan%' or `email` like '%Ivan%' or `phone` like '%Ivan%')))