app/Http/Controllers/admin/AdminTeacherController.php

    public function index()
    {
        $teachers = Teacher::with('subject')->paginate(10);

        $subjects = Subject::all();
---
select * from `subjects` where `subjects`.`id` in (1, 2, 3, 4, 5, 6, 10)
select * from `teachers` limit 10 offset 0
select count(*) as aggregate from `teachers`
select * from `subjects`

    public function store(Request $request)
    {
        $validated = $request->validate([
            'name' => 'required|string|max:255',
            'subject_id' => 'required|exists:subjects,id',
            'email' => 'required|email|unique:teachers,email',
            'phone' => 'required|string|max:50',
            'address' => 'required|string',
        ]);

        Teacher::create($validated);
---
insert into `teachers` (`name`, `subject_id`, `email`, `phone`, `address`, `updated_at`, `created_at`) values ('Fssad', '7', 'fafadadwa@nad.com', '23423432432', 'jl aasdfasgaehdagd', '2025-11-25 02:47:00', '2025-11-25 02:47:00')

    public function update(Request $request, $id)
    {
        $teacher = Teacher::findOrFail($id);

        $validated = $request->validate([
            'name' => 'required|string|max:255',
            'subject_id' => 'required|exists:subjects,id',
            'email' => 'required|email|unique:teachers,email,' . $teacher->id,
            'phone' => 'required|string|max:50',
            'address' => 'required|string',
        ]);

        $teacher->update($validated);
---
select * from `teachers` where `teachers`.`id` = '6' limit 1
update `teachers` set `email` = 'xiangwoshi@gmail.coms', `teachers`.`updated_at` = '2025-11-25 03:19:01' where `id` = 6

    public function delete($id)
    {
        $teacher = Teacher::findOrFail($id);
        $teacher->delete();
---
select * from `teachers` where `teachers`.`id` = '9' limit 1
delete from `teachers` where `id` = 9